###################################################################

# Created by write_sdc on Thu Oct 24 09:54:57 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.5 [current_design]
set_max_transition 1.5 [current_design]
set_load -pin_load 0.5 [get_ports {right_taillight_control[2]}]
set_load -pin_load 0.5 [get_ports {right_taillight_control[1]}]
set_load -pin_load 0.5 [get_ports {right_taillight_control[0]}]
set_load -pin_load 0.5 [get_ports {left_taillight_control[2]}]
set_load -pin_load 0.5 [get_ports {left_taillight_control[1]}]
set_load -pin_load 0.5 [get_ports {left_taillight_control[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports brake]
set_max_fanout 1 [get_ports turn_right]
set_max_fanout 1 [get_ports turn_left]
create_clock [get_ports clk]  -period 12.5  -waveform {0 7.5}
set_clock_latency 1.5  [get_clocks clk]
set_clock_uncertainty -setup 1.2  [get_clocks clk]
set_clock_uncertainty -hold 0.8  [get_clocks clk]
set_clock_transition -max -rise 0.25 [get_clocks clk]
set_clock_transition -min -rise 0.25 [get_clocks clk]
set_clock_transition -max -fall 0.28 [get_clocks clk]
set_clock_transition -min -fall 0.28 [get_clocks clk]
create_clock -name v_clk  -period 12.5  -waveform {0 7.5}
set_input_delay -clock v_clk  2  [get_ports rst_n]
set_input_delay -clock v_clk  2  [get_ports brake]
set_input_delay -clock v_clk  2  [get_ports turn_right]
set_input_delay -clock v_clk  2  [get_ports turn_left]
set_output_delay -clock v_clk  3  [get_ports {right_taillight_control[2]}]
set_output_delay -clock v_clk  3  [get_ports {right_taillight_control[1]}]
set_output_delay -clock v_clk  3  [get_ports {right_taillight_control[0]}]
set_output_delay -clock v_clk  3  [get_ports {left_taillight_control[2]}]
set_output_delay -clock v_clk  3  [get_ports {left_taillight_control[1]}]
set_output_delay -clock v_clk  3  [get_ports {left_taillight_control[0]}]
set_input_transition -max -rise 0.25  [get_ports clk]
set_input_transition -max -fall 0.28  [get_ports clk]
set_input_transition -min -rise 0.25  [get_ports clk]
set_input_transition -min -fall 0.28  [get_ports clk]
set_input_transition -max -rise 0.25  [get_ports rst_n]
set_input_transition -max -fall 0.28  [get_ports rst_n]
set_input_transition -min -rise 0.25  [get_ports rst_n]
set_input_transition -min -fall 0.28  [get_ports rst_n]
set_input_transition -max -rise 0.25  [get_ports brake]
set_input_transition -max -fall 0.28  [get_ports brake]
set_input_transition -min -rise 0.25  [get_ports brake]
set_input_transition -min -fall 0.28  [get_ports brake]
set_input_transition -max -rise 0.25  [get_ports turn_right]
set_input_transition -max -fall 0.28  [get_ports turn_right]
set_input_transition -min -rise 0.25  [get_ports turn_right]
set_input_transition -min -fall 0.28  [get_ports turn_right]
set_input_transition -max -rise 0.25  [get_ports turn_left]
set_input_transition -max -fall 0.28  [get_ports turn_left]
set_input_transition -min -rise 0.25  [get_ports turn_left]
set_input_transition -min -fall 0.28  [get_ports turn_left]
